04_OpenFoam/_ref/OpenFOAM-14/multiphaseEuler/bubbleColumnEvaporatingReacting/0/epsilon.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [turbulentEpsilon];

internalField   uniform 1.5e-4;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }
    outlet
    {
        type            inletOutlet;
        phi             phi.gas;
        inletValue      $internalField;
    }
    walls
    {
        type            epsilonWallFunction;
        value           $internalField;
    }
}

sources
{
    phaseChange
    {
        type            uniformInletOutlet;
        uniformInletValue 1.5e-4;
    }
}

// ************************************************************************* //
